tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/uart_regs.h
#if (MXC_UART_REV > 0)
/**
 * @ingroup uart_registers
 * @defgroup UART_IDLE_Register UART_IDLE
 * @brief    UART_IDLE register fields and masks
 * @{
 */
#define MXC_F_UART_IDLE_TX_RX_IDLE_POS                      0                                                                       /**< TX_RX_IDLE Field Position.             */
#define MXC_F_UART_IDLE_TX_RX_IDLE                          ((uint32_t)(0x00000001UL << MXC_F_UART_IDLE_TX_RX_IDLE_POS))            /**< TX_RX_IDLE Field Mask.                 */
#define MXC_F_UART_IDLE_TX_IDLE_POS                         1                                                                       /**< TX_IDLE Field Position.                */
#define MXC_F_UART_IDLE_TX_IDLE                             ((uint32_t)(0x00000001UL << MXC_F_UART_IDLE_TX_IDLE_POS))               /**< TX_IDLE Field Mask.                    */
#define MXC_F_UART_IDLE_RX_IDLE_POS                         2                                                                       /**< RX_IDLE Field Position.                */
#define MXC_F_UART_IDLE_RX_IDLE                             ((uint32_t)(0x00000001UL << MXC_F_UART_IDLE_RX_IDLE_POS))               /**< RX_IDLE Field Mask.                    */
/** @} */
#endif
/**
 * @ingroup UART_CTRL_register
 * @defgroup UART_DATA_SIZE_Values Data Size Settings
 * @brief    UART Data Size Field Settings and Masks
 * @{
 */
#define MXC_V_UART_CTRL_DATA_SIZE_5_BITS                                        ((uint32_t)(0x00000000UL))  /**< Value to set to 5 data bits. */
#define MXC_V_UART_CTRL_DATA_SIZE_6_BITS                                        ((uint32_t)(0x00000001UL))  /**< Value to set to 6 data bits. */
#define MXC_V_UART_CTRL_DATA_SIZE_7_BITS                                        ((uint32_t)(0x00000002UL))  /**< Value to set to 7 data bits. */
#define MXC_V_UART_CTRL_DATA_SIZE_8_BITS                                        ((uint32_t)(0x00000003UL))  /**< Value to set to 8 data bits. */

#define MXC_S_UART_CTRL_DATA_SIZE_5_BITS                                        ((uint32_t)(MXC_V_UART_CTRL_DATA_SIZE_5_BITS   << MXC_F_UART_CTRL_DATA_SIZE_POS))   /**< Shifted value to set to 5 data bits. */
#define MXC_S_UART_CTRL_DATA_SIZE_6_BITS                                        ((uint32_t)(MXC_V_UART_CTRL_DATA_SIZE_6_BITS   << MXC_F_UART_CTRL_DATA_SIZE_POS))   /**< Shifted value to set to 6 data bits. */
#define MXC_S_UART_CTRL_DATA_SIZE_7_BITS                                        ((uint32_t)(MXC_V_UART_CTRL_DATA_SIZE_7_BITS   << MXC_F_UART_CTRL_DATA_SIZE_POS))   /**< Shifted value to set to 7 data bits. */
#define MXC_S_UART_CTRL_DATA_SIZE_8_BITS                                        ((uint32_t)(MXC_V_UART_CTRL_DATA_SIZE_8_BITS   << MXC_F_UART_CTRL_DATA_SIZE_POS))   /**< Shifted value to set to 8 data bits. */
/** @} */
/**
 * @ingroup UART_CTRL_register
 * @defgroup UART_PARITY_Values Parity Settings
 * @brief    UART Parity Field Settings and Masks
 * @{
 */
#define MXC_V_UART_CTRL_PARITY_DISABLE                                          ((uint32_t)(0x00000000UL))  /**< Parity disabled value. */
#define MXC_V_UART_CTRL_PARITY_ODD                                              ((uint32_t)(0x00000001UL))  /**< Odd Parity value.      */
#define MXC_V_UART_CTRL_PARITY_EVEN                                             ((uint32_t)(0x00000002UL))  /**< Even Parity value.     */
#define MXC_V_UART_CTRL_PARITY_MARK                                             ((uint32_t)(0x00000003UL))  /**< Mark Parity value.     */

#define MXC_S_UART_CTRL_PARITY_DISABLE                                          ((uint32_t)(MXC_V_UART_CTRL_PARITY_DISABLE  << MXC_F_UART_CTRL_PARITY_POS))  /**< Parity disabled shifted value. */
#define MXC_S_UART_CTRL_PARITY_ODD                                              ((uint32_t)(MXC_V_UART_CTRL_PARITY_ODD      << MXC_F_UART_CTRL_PARITY_POS))  /**< Odd Parity shifted value.      */
#define MXC_S_UART_CTRL_PARITY_EVEN                                             ((uint32_t)(MXC_V_UART_CTRL_PARITY_EVEN     << MXC_F_UART_CTRL_PARITY_POS))  /**< Even Parity shifted value.     */
#define MXC_S_UART_CTRL_PARITY_MARK                                             ((uint32_t)(MXC_V_UART_CTRL_PARITY_MARK     << MXC_F_UART_CTRL_PARITY_POS))  /**< Mark Parity shifted value.     */
/** @} */

/** @} */
#ifdef __cplusplus
}
#endif

#endif   /* _MXC_UART_REGS_H_ */

